driver-tests/bpelse/misc/MiscJbi/test/ReserveLot/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="stc:ParkingLotAdvisor/types">
  <soapenv:Body>
    <typ:reserveParkingSpot>
      <typ:int_1>5</typ:int_1>
    </typ:reserveParkingSpot>
  </soapenv:Body>
</soapenv:Envelope>